# Pandas DataFrame

- stores data in tabular form
- Each column can be of a different data type (e.g., integers, floats, strings), 
- Each rows represent individual records.

In [12]:
import pandas as pd

In [4]:
df1=pd.DataFrame() #Creating an empty DataFrame

In [6]:
type(df1)
print(df1)

Empty DataFrame
Columns: []
Index: []

In [7]:
df1.columns

RangeIndex(start=0, stop=0, step=1)

In [8]:
df1.index

RangeIndex(start=0, stop=0, step=1)

In [32]:
students_list=[["Claudia", "Alice",26,"data science", 86],
             ["Clarisse", "Lorena", 35, "Data analytics", 90],
             ["Merci", "Kael", 30, "Data engineering", 80],
             ["Emma", "Johnson",28, "Cyber security", 75]]  # Defining  the nested list

In [33]:
students_df=pd.DataFrame(students_list)
students_df # converting a list into a DataFrame

          0        1   2                 3   4
0   Claudia    Alice  26      data science  86
1  Clarisse   Lorena  35    Data analytics  90
2     Merci     Kael  30  Data engineering  80
3      Emma  Johnson  28    Cyber security  75

In [25]:
students_df=pd.DataFrame(student_list, columns=["First_Name", "Last_Name","Age","Major","Score"])
students_df # renaming the variable (header of columns)

  First_Name Last_Name  Age             Major  Score
0    Claudia     Alice   26      data science     86
1   Clarisse    Lorena   35    Data analytics     90
2      Merci      Kael   30  Data engineering     80
3       Emma   Johnson   28    Cyber security     75

In [39]:
students_df1=pd.DataFrame(student_list, columns=["First_Name", "Last_Name","Age","Major","Score"],index=["ID_1","ID_2","ID_3","ID_4"])
students_df1 # renaming the Index (rows indexes)

     First_Name Last_Name  Age             Major  Score
ID_1    Claudia     Alice   26      data science     86
ID_2   Clarisse    Lorena   35    Data analytics     90
ID_3      Merci      Kael   30  Data engineering     80
ID_4       Emma   Johnson   28    Cyber security     75

In [29]:
students_dict={"First_Name":["Claudia","Clarisse", "Merci","Emma"],
               "Last_Name":["Alice","Lorena","Kael","Johnson"],
               "Age": [26,35,30,28],
               "Major":["data science","Data analytics","Data engineering","Cyber security"], 
               "Score":[86,90,80,75]}   # Defining a dictionary

In [40]:
students_df2=pd.DataFrame(students_dict)  # converting a dictionnary into a DataFrame
students_df2

  First_Name Last_Name  Age             Major  Score
0    Claudia     Alice   26      data science     86
1   Clarisse    Lorena   35    Data analytics     90
2      Merci      Kael   30  Data engineering     80
3       Emma   Johnson   28    Cyber security     75

In [41]:
students_df2=pd.DataFrame(students_dict, columns=["First_Name","Last_Name","Age"])   # Extracting specific columns
students_df2

  First_Name Last_Name  Age
0    Claudia     Alice   26
1   Clarisse    Lorena   35
2      Merci      Kael   30
3       Emma   Johnson   28

In [42]:
students_df2=pd.DataFrame(students_dict, columns=["First_Name","Last_Name","Age", "City"]) 
students_df2    # Adding a variable with null value

  First_Name Last_Name  Age City
0    Claudia     Alice   26  NaN
1   Clarisse    Lorena   35  NaN
2      Merci      Kael   30  NaN
3       Emma   Johnson   28  NaN

In [43]:
students_df1

     First_Name Last_Name  Age             Major  Score
ID_1    Claudia     Alice   26      data science     86
ID_2   Clarisse    Lorena   35    Data analytics     90
ID_3      Merci      Kael   30  Data engineering     80
ID_4       Emma   Johnson   28    Cyber security     75

# Attribute of a DataFrame 
- variable index (Variable labels)
- Index( rows labels)

In [44]:
students_df1.columns

Index(['First_Name', 'Last_Name', 'Age', 'Major', 'Score'], dtype='object')

In [45]:
students_df1.index

Index(['ID_1', 'ID_2', 'ID_3', 'ID_4'], dtype='object')

In [46]:
students_df1.shape # extracting the dimension of the DataFrame

(4, 5)

In [47]:
students_df1.head(2) # extracting a certain number of first rows using "head" n a DataFrame

     First_Name Last_Name  Age           Major  Score
ID_1    Claudia     Alice   26    data science     86
ID_2   Clarisse    Lorena   35  Data analytics     90

In [48]:
students_df1.tail(3) # extracting a certain number of last rows using "tail" in a DataFramen

     First_Name Last_Name  Age             Major  Score
ID_2   Clarisse    Lorena   35    Data analytics     90
ID_3      Merci      Kael   30  Data engineering     80
ID_4       Emma   Johnson   28    Cyber security     75

In [49]:
students_df1.info() # summary of a data frame which gives the total number columns and rows

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ID_1 to ID_4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First_Name  4 non-null      object
 1   Last_Name   4 non-null      object
 2   Age         4 non-null      int64
 3   Major       4 non-null      object
 4   Score       4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 192.0+ bytes

In [50]:
students_df1.describe() # a summary of statistical details

            Age      Score
count   4.00000   4.000000
mean   29.75000  82.750000
std     3.86221   6.601767
min    26.00000  75.000000
25%    27.50000  78.750000
50%    29.00000  83.000000
75%    31.25000  87.000000
max    35.00000  90.000000